<script lang="ts" setup>
</script>

<template>
    <div class="tip custom-block">
    <p class="custom-block-title">📚 Что такое access/refresh токены?</p>
    <p>Токены — это временные ключи доступа, которые генерируются при аутентификации пользователя (входе в учётную запись). Токена два и они работают в паре. При каждом запросе к серверу, отправляется access-токен (токен доступа, имеющий короткий срок жизни). Когда срок жизни access-токена будет окончен, необходимо запросить у сервера выдачу нового access. Такой запрос делается с refresh-токеном. Kodzero SDK делает всё это автоматически.</p>
    </div>
</template>